OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f2331.h
//----------------------------- CONFIG2H Options -------------------------------

#define _WDTEN_OFF_2H           0xFE    // WDT disabled (control is placed on the SWDTEN bit).
#define _WDTEN_ON_2H            0xFF    // WDT enabled.
#define _WDPS_1_2H              0xE1    // 1:1.
#define _WDPS_2_2H              0xE3    // 1:2.
#define _WDPS_4_2H              0xE5    // 1:4.
#define _WDPS_8_2H              0xE7    // 1:8.
#define _WDPS_16_2H             0xE9    // 1:16.
#define _WDPS_32_2H             0xEB    // 1:32.
#define _WDPS_64_2H             0xED    // 1:64.
#define _WDPS_128_2H            0xEF    // 1:128.
#define _WDPS_256_2H            0xF1    // 1:256.
#define _WDPS_512_2H            0xF3    // 1:512.
#define _WDPS_1024_2H           0xF5    // 1:1024.
#define _WDPS_2048_2H           0xF7    // 1:2048.
#define _WDPS_4096_2H           0xF9    // 1:4096.
#define _WDPS_8192_2H           0xFB    // 1:8192.
#define _WDPS_16384_2H          0xFD    // 1:16384.
#define _WDPS_32768_2H          0xFF    // 1:32768.
#define _WINEN_ON_2H            0xDF    // WDT window enabledbled.
#define _WINEN_OFF_2H           0xFF    // WDT window disabled.

//----------------------------- CONFIG3L Options -------------------------------

#define _PWMPIN_ON_3L           0xFB    // PWM outputs drive active states upon Reset.
#define _PWMPIN_OFF_3L          0xFF    // PWM outputs disabled upon Reset (default).
#define _LPOL_LOW_3L            0xF7    // PWM0, 2, 4 and 6 are active-low.
#define _LPOL_HIGH_3L           0xFF    // PWM0, 2, 4 and 6 are active-high.
#define _HPOL_LOW_3L            0xEF    // PWM1, 3, 5 and 7 are active-low.
#define _HPOL_HIGH_3L           0xFF    // PWM1, 3, 5 and 7 are active-high.
#define _T1OSCMX_OFF_3L         0xDF    // Standard (legacy) Timer1 oscillator operation.
#define _T1OSCMX_ON_3L          0xFF    // Low-power Timer1 operation when microcontroller is in Sleep mode.

//----------------------------- CONFIG3H Options -------------------------------

#define _MCLRE_OFF_3H           0x7F    // Disabled.
#define _MCLRE_ON_3H            0xFF    // Enabled.

//----------------------------- CONFIG4L Options -------------------------------

#define _STVREN_OFF_4L          0xFE    // Stack full/underflow will not cause Reset.
#define _STVREN_ON_4L           0xFF    // Stack full/underflow will cause Reset.
#define _LVP_OFF_4L             0xFB    // Low-voltage ICSP disabled.
#define _LVP_ON_4L              0xFF    // Low-voltage ICSP enabled.
#define _DEBUG_ON_4L            0x7F    // Background debugger enabled; RB6 and RB7 are dedicated to In-Circuit Debug.
#define _DEBUG_OFF_4L           0xFF    // Background debugger disabled; RB6 and RB7 configured as general purpose I/O pins.

//----------------------------- CONFIG5L Options -------------------------------

#define _CP0_ON_5L              0xFE    // Block 0 (000200-000FFFh) code-protected.
#define _CP0_OFF_5L             0xFF    // Block 0 (000200-000FFFh) not code-protected.
#define _CP1_ON_5L              0xFD    // Block 1 (001000-001FFF) code-protected.
#define _CP1_OFF_5L             0xFF    // Block 1 (001000-001FFF) not code-protected.

//----------------------------- CONFIG5H Options -------------------------------

#define _CPB_ON_5H              0xBF    // Boot Block (000000-0001FFh) code-protected.
#define _CPB_OFF_5H             0xFF    // Boot Block (000000-0001FFh) not code-protected.
#define _CPD_ON_5H              0x7F    // Data EEPROM code-protected.
#define _CPD_OFF_5H             0xFF    // Data EEPROM not code-protected.

//----------------------------- CONFIG6L Options -------------------------------

#define _WRT0_ON_6L             0xFE    // Block 0 (000200-000FFFh) write-protected.
#define _WRT0_OFF_6L            0xFF    // Block 0 (000200-000FFFh) not write-protected.
#define _WRT1_ON_6L             0xFD    // Block 1 (001000-001FFF) write-protected.
#define _WRT1_OFF_6L            0xFF    // Block 1 (001000-001FFF) not write-protected.

//----------------------------- CONFIG6H Options -------------------------------

#define _WRTC_ON_6H             0xDF    // Configuration registers (300000-3000FFh) write-protected.
#define _WRTC_OFF_6H            0xFF    // Configuration registers (300000-3000FFh) not write-protected.
#define _WRTB_ON_6H             0xBF    // Boot Block (000000-0001FFh) write-protected.
#define _WRTB_OFF_6H            0xFF    // Boot Block (000000-0001FFh) not write-protected.
#define _WRTD_ON_6H             0x7F    // Data EEPROM write-protected.
#define _WRTD_OFF_6H            0xFF    // Data EEPROM not write-protected.

//----------------------------- CONFIG7L Options -------------------------------

#define _EBTR0_ON_7L            0xFE    // Block 0 (000200-000FFFh) protected from table reads executed in other blocks.
#define _EBTR0_OFF_7L           0xFF    // Block 0 (000200-000FFFh) not protected from table reads executed in other blocks.
#define _EBTR1_ON_7L            0xFD    // Block 1 (001000-001FFF) protected from table reads executed in other blocks.
#define _EBTR1_OFF_7L           0xFF    // Block 1 (001000-001FFF) not protected from table reads executed in other blocks.

//----------------------------- CONFIG7H Options -------------------------------

#define _EBTRB_ON_7H            0xBF    // Boot Block (000000-0001FFh) not protected from table reads executed in other blocks.
#define _EBTRB_OFF_7H           0xFF    // Boot Block (000000-0001FFh) not protected from table reads executed in other blocks.

//==============================================================================

#define __DEVID1                0x3FFFFE
#define __DEVID2                0x3FFFFF

#define __IDLOC0                0x200000
#define __IDLOC1                0x200001
#define __IDLOC2                0x200002
#define __IDLOC3                0x200003
#define __IDLOC4                0x200004
#define __IDLOC5                0x200005
#define __IDLOC6                0x200006
#define __IDLOC7                0x200007

#endif // #ifndef __PIC18F2331_H__
